---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarShapeVertex.Dispose
source: html/2d861dc6-df4a-5328-e67f-214190146b6b.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeVertex.Dispose Method

Releases all resources used by the RebarShapeVertex

## Syntax (C#)
```csharp
public void Dispose()
```